<?php
/**
 * Created by PhpStorm.
 * User: Asus
 * Date: 17.07.2017
 * Time: 13:16
 */
require_once('functions.php');

//echo '<p>============= Задание 1 ================</p>';
//
//
//$str_arr = ['blablabla', '123123123', 'bobcat', 'sequence']; //тестовый массив строк
//echo task1($str_arr, true); // сразу проверим со склееной строкой.
//
//
//echo '<p>============= Задание 2 ================</p>';
//
//
//echo task2([1, 'SDFSDF', 'sdfsd', '3454353', 'ADF'], '+sd', 5); // Проверим на обнаружение ошибок
//echo '<p>======</p>';
//echo task2([1, 4, 5, 6], '*'); // Проверим без ошибок
//
//
//echo '<p>============= Задание 3 ================</p>';
//
//echo task3('*', 1, 2, 3, 5.2);
//
//echo '<p>============= Задание 4 ================</p>';
//
//echo task4(15, 21);

echo '<p>============= Задание 5 ================</p>';

$palindrome = 'QWE rty   YTr    EWQ';
task5($palindrome);
